import random

# a = input('请输入成绩：')
# print(type(a))    # 类型是str

# a = int(input('请输入成绩：'))   # 强制转换类型为int
# b = int(input('请输入成绩：'))
# print(a + b)
# if a > 60:
#     print("及格")
# else:
#     print('下次努力')


# print("请输入相关天气，可以是晴天、阴天、雨天")
# t = input('请输入天气：')
# if t == '晴天':
#     print("去夏游")
# else:
#     if t == '阴天':
#         print('去图书馆')
#     else:
#         if t == '雨天':
#             print('睡觉')
#         else:
#             print('输入的不正确')
# -------------------------------------------------------------

# num1 = int(input('请输入数字:'))
# if num1 % 2 == 0:
#     print('偶数')
# else:
#     print('奇数')
#
# ---------------------------------
# print("请输入相关天气，可以是晴天、阴天、雨天、雪天、多云")
# t = input('请输入天气：')
# if t == '晴天':
#     print("去夏游")
# else:
#     if t == '多云':
#         print('看电视')
#     else:
#         if t == '雨天':
#             print('在家复习')
#         else:
#             if t == '雪天':
#                 print('打雪仗')
#             else:
#                 print('没计划')

# ------------------------------------------------------------
# print("现在是什么灯？")
# t = input('请输入：')
# if t == '红灯':
#     print("红灯停")
# else:
#     if t == '绿灯':
#         print('绿灯行')
#     else:
#         if t == '黄灯':
#             print('等一等')
#         else:
#             print('输入错误')

print("---------------------------------------------")
# score = int(input('请输入你的成绩：'))
# if score < 60:
#     print("不及格")
# else:
#     if score <= 70:
#         print('合格')
#     else:
#         if score <= 80:
#             print('良好')
#         else:
#             if score <= 90:
#                 print('优秀')
#             elif score <= 100:
#                 print('卓越')

# ---------------------------------------------------------------------------------

# 2、税务部门征收所得税. 规定如下:
# 1). 收入在2000以下的. 免征.
# 2). 收入在2000-4000的, 超过2000部分要征收3%的税.
# 3). 收入在4000-6000的, 超过4000部分要征收5%的税.
# 4). 收入在6000-10000的, 超过6000部分要征收8%的税.
# 4). 收入在10000以上的, 超过部分征收20%的税.
# 注, 如果一个人的收入是8000, 那么他要交2000到4000的税加上4000到6000的税加上6000到10000的税.
# 收入 = 8000-(4000-2000)*3%-(6000-4000)*5%-(10000-6000)*8%
# 让用户输入它的工资, 计算最终用户拿到手是多少钱.

# m = int(input('请输入你的收入：'))
# if m <= 2000:
#     print("免征")
# else:
#     if m < 4000:
#         s = (m - 2000) * 0.03
#         print(f'收{s}的税')
#     else:
#         if m < 6000:
#             s = (m - 4000) * 0.05 + 2000 * 0.03
#             print(f'收{s}的税')
#         else:
#             if m < 10000:
#                 s = (m - 6000) * 0.08 + 2000 * 0.05 + 2000 * 0.03
#                 print(f'收{s}的税')
#             elif m >= 10000:
#                 s = (m - 10000) * 0.2 + 4000 * 0.08 + 2000 * 0.05 + 2000 * 0.03
#                 print(f'收{s}的税')

# print('------------------------------------------------------------')
# # 3、商场满减活动
# # 消费满减活动
# # 满100减50
# # 满减后金额不足99不包邮，需要另付邮费6元
# p = float(input('请输入你的消费：'))
# if p >= 100:
#     p = p - 50
#     if p < 99:
#         p = p + 6
#         print(f"您消费了{p}元，不包邮")
#     else:
#         print(f"您消费了{p}元，包邮")
# else:
#     p = p + 6
#     print(f"您消费了{p}元，不包邮,不参加满减")

# print('---------------------------------------------------')

# 4、身份证有效性校验
# if 语句判断练习：
# 1、提示用户输入身份证号
# 2、判断用户输入的身份证长度是不是18位,前17位是数字
# 最后一位可以是字母x和X或者数字
# ---如果不是，提示"输入错误"
# ---如果是，读取身份证里的出生年月日，并赋给birthday这个变量
# card = input('请输入你的身份证号，18位：')
#
# if len(card) == 18 and card[:17].isdigit():
#     # if card[-1::] == 'X' or card[-1::] == 'x' or card[-1::].isdigit():
#     if card[-1::] in ['X', 'x'] or card[-1::].isdigit():
#         birthday = card[6:14]
#         print('宁的生日是' + birthday)
#     else:
#         print("2号码输入错误，请检查")
# else:
#     print("号码输入错误，请检查")

print('--------------------------------------------------')
# 7、判断闰年?
# 用户输入年份year, 判断是否为闰年?
# year能被4整除但是不能被100整除
# 或者
# year能被400整除, 那么就是闰年;
# year = int(input('请输入年份：'))
#
# if year % 4 == 0:
#     if year % 100 != 0:
#         print(f'{year}是闰年')
#     else:
#         print(f'{year}不是闰年')
# else:
#     print(f'{year}不是闰年')

# 9、练习三
# 实现征兵条件的删选：
# 男兵，年龄18 - 24；
# 女兵，年龄17 - 22；
# 视力，4.8
# 或以上(输入的值应在4.0 - 5.3范围内)
#
# 根据用户输入的值，做判断，比如：
# 男、18、5.0 -->符合入伍基本条件
# 男、21、4.3 -->视力不符
# 男、24、5.4 -->视力值输入错误
# sex = input('请输入性别：')
# age = int(input('请输入年龄（整数）：'))
# sl = float(input('请输入视力：'))
# if sex == '男':
#     if 24 >= age >= 18:
#         if 4.0 < sl < 5.3:
#             if sl >= 4.8:
#                 print('符合入伍基本条件')
#             else:
#                 print('视力不符')
#         else:
#             print('视力值输入错误')
#     else:
#         print('年龄不符')
# else:
#     if sex == '女':
#         if 22 >= age >= 17:
#             if 4.0 < sl < 5.3:
#                 if sl >= 4.8:
#                     print('符合入伍基本条件')
#                 else:
#                     print('视力不符')
#             else:
#                 print('视力值输入错误')
#         else:
#             print('年龄不符')
#     else:
#         print('性别输入错误')

# atm取款题目
# 模拟ATM取款机   设置用户余额为5000元
# 1、提示用户输入银行卡密码 密码正确，进入下一个判断，密码错误，提示输入有误
# 2、提示用户选择需要办理的业务(存款/取款)
# 如果选择存款业务，提示让用户输如存款金额，最后显示存款后余额
# 如果选择取款业务
# 判断取款金额是否超过了余额
# 超过了： 告知用户余额不足
# 未超过： 提示取款成功，请取走现金，并显示当前剩余余额

money = 5000
pad = input('请输入银行卡密码（六位数字）：')
if len(pad) == 6 and pad.isdigit():
    if pad == '123456':
        fw = int(input("请选择1 存款服务，2 取款服务："))
        if fw == 1:
            print(f"您的余额是{money}")
            cun = int(input("请输入存款金额："))
            money = money + cun
            print(f"存款成功，您的余额是{money}")
        else:
            if fw == 2:
                print(f"您的余额是{money}")
                qu = int(input("请输入取款金额："))
                if money >= qu:
                    money = money - qu
                    print(f'取款成功，请取走现金，当前剩余余额为{money}')
                else:
                    print('余额不足')
            else:
                print("服务输入错误")
    else:
        print("密码输入错误，请重新输入")
else:
    print("密码格式错误")

# 10、抽奖的项目
# 奖池自定义
# ['笔记本一台','冰箱一台','奔驰一辆','谢谢惠顾'...]
# 用户进行积分抽奖 20积分抽一次
# 如果未中奖，告知用户没有中奖，还剩？积分，还能抽多少次
# 如果抽中，告知用户抽到了什么，还剩多少积分，还能抽多少次
# 抽完一次之后，如果积分足够，要询问用户，是否继续抽奖
# ---是 继续抽
# ---否 结束抽奖

'''
# list1 = ['笔记本一台', '冰箱一台', '奔驰一辆', '谢谢惠顾', '中性笔', '', '', '', '', '', '']
# jf = float(input('您有多少积分：'))
# if jf >= 20:
#     random_value = random.choice(list1)
#     if random_value in ['', '谢谢惠顾']:
#         jf = jf - 20
#         n = jf / 20
#         print(f'您未中奖,还剩{jf}点积分,还能抽{n}次')
#     else:
#         jf = jf - 20
#         n = jf / 20
#         print(f'您中了{random_value},还剩{jf}点积分,还能抽{n}次')
# else:
#     print("积分不足")
'''

list1 = ['笔记本一台', '冰箱一台', '奔驰一辆', '谢谢惠顾', '中性笔', '', '', '', '', '', '']
jf = float(input('您有多少积分：'))
if jf >= 20:
    # random_value = random.choice(list1)
    n = jf / 20
    for random_value in list1:
        if random_value in ['', '谢谢惠顾']:
            jf = jf - 20
            n = n - 1
            print(f'您未中奖,还剩{jf}点积分,还能抽{n}次')
            h = input("是否还要抽奖:")
            if h == '是':
                continue
            else:
                if h == '否':
                    print(f'您还剩{jf}点积分,还能抽{n}次')
                    break
                else:
                    print('回答错误，跳出系统')
                    break
        else:
            jf = jf - 20
            n = jf / 20
            print(f'您中了{random_value},还剩{jf}点积分,还能抽{n}次')
            h = input("是否还要抽奖:")
            if h == '是':
                continue
            else:
                if h == '否':
                    print(f'您还剩{jf}点积分,还能抽{n}次')
                    break
                else:
                    print('回答错误，跳出系统')
                    break
else:
    print("积分不足")
